{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["Hi", "Hello", "Hey", "Greetings", "Good day"],
      "responses": ["Hello!", "Hi there, how can I help?", "Greetings! How may I assist you today?"],
      "context_set": ""
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thanks for the help"],
      "responses": ["You're welcome!", "Glad I could help!", "My pleasure!"],
      "context_set": ""
    },
    {
      "tag": "no answer",
      "patterns": [],
      "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand"],
      "context_set": ""
    },
    {
      "tag": "goodbye",
      "patterns": ["Goodbye", "Bye", "See you later"],
      "responses": ["Goodbye! Have a great day!", "See you later!", "Farewell!"],
      "context_set": ""
    },
    {
      "tag": "DBATU",
      "patterns": ["Tell me about DBATU", "What is DBATU?", "DBATU information"],
      "responses": ["Dr. Babasaheb Ambedkar Technological University (DBATU) is a renowned technological university in Maharashtra, India."],
      "context_set": ""
    },
    {
      "tag": "name",
      "patterns": ["What's your name?", "Tell me your name"],
      "responses": ["I'm just a computer program, so I don't have a name."],
      "context_set": ""
    },
    {
      "tag": "hours",
      "patterns": ["What are the working hours?", "Office hours"],
      "responses": ["The working hours of DBATU may vary depending on the specific department or office. You may need to check with them directly for accurate information."],
      "context_set": ""
    },
    {
      "tag": "clubs",
      "patterns": ["Tell me about clubs at DBATU", "Are there any student clubs?"],
      "responses": ["Yes, DBATU has various student clubs and organizations that students can join. These clubs promote extracurricular activities and personal development."],
      "context_set": ""
    },
    {
      "tag": "COMPUTER HOD",
      "patterns": ["Who is the Head of the Computer Department?", "Tell me about the Computer HOD"],
      "responses": ["I do not have the current information about the Head of the Computer Department at DBATU. You may want to check the official website for the most up-to-date information."],
      "context_set": ""
    },
    {
      "tag": "number",
      "patterns": ["What is the contact number?", "Phone number", "Contact information"],
      "responses": ["The contact number for DBATU may vary by department. Please check the official website or contact the relevant department for their specific contact information."],
      "context_set": ""
    },
    {
      "tag": "certification",
      "patterns": ["Tell me about certifications", "Certification programs", "Courses with certifications"],
      "responses": ["DBATU offers various certification programs in different technical fields. You can visit the university's official website or contact the academic department for more information about specific certification courses."],
      "context_set": ""
    },
    {
      "tag": "IT or CSE",
      "patterns": ["IT or CSE Department", "Information Technology or Computer Science Department", "Tell me about IT and CSE"],
      "responses": ["DBATU has separate departments for Information Technology (IT) and Computer Science and Engineering (CSE). These departments offer various undergraduate and postgraduate programs in their respective fields."],
      "context_set": ""
    },
    {
      "tag": "course",
      "patterns": ["Available courses", "What courses does DBATU offer?", "List of programs"],
      "responses": ["DBATU offers a wide range of undergraduate, postgraduate, and doctoral programs in fields such as engineering, technology, and management. You can find detailed information about these programs on the official university website."],
      "context_set": ""
    },
    {
      "tag": "admission",
      "patterns": ["How to apply for admission?", "Admission process", "Application procedure"],
      "responses": ["The admission process at DBATU may vary by program and category. It is recommended to check the official admission guidelines and announcements on the university's website for detailed information on how to apply for admission."],
      "context_set": ""
    },
    {
      "tag": "fees",
      "patterns": ["Tuition fees", "What are the fees?", "Cost of education"],
      "responses": ["The tuition fees for courses at DBATU can vary based on the program, category, and other factors. It's best to check the official website or contact the university's finance department for specific fee details."],
      "context_set": ""
    },
    {
      "tag": "Governing Council",
      "patterns": ["Tell me about the Governing Council", "Who is on the Governing Council?", "GC members"],
      "responses": ["The Governing Council of DBATU is responsible for the governance and administration of the university. It includes members from various fields and backgrounds. For specific details about the current members, please visit the official university website."],
      "context_set": ""
    },
    {
      "tag": "Hostel",
      "patterns": ["Information about hostels", "Are there hostels on campus?", "Hostel facilities"],
      "responses": ["DBATU provides hostel facilities for students. You can find information about the hostels, including availability, facilities, and application procedures, on the university's official website or by contacting the hostel authorities."],
      "context_set": ""
    },
    {
      "tag": "event",
      "patterns": ["Upcoming events", "University events", "What events are happening at DBATU?"],
      "responses": ["DBATU hosts various events and activities throughout the year, including academic, cultural, and sports events. You can stay updated with the latest event announcements on the university's official website and social media channels."],
      "context_set": ""
    },
    {
      "tag": "syllabus",
      "patterns": ["Syllabus information", "Where can I find the syllabus?", "Curriculum details"],
      "responses": ["The syllabus for different courses at DBATU can be found on the official university website or by contacting the academic department of the respective course. The syllabus may be subject to updates and revisions, so it's advisable to refer to the official sources."],
      "context_set": ""
    },
    {
      "tag": "library",
      "patterns": ["Library information", "Tell me about the university library", "Library resources"],
      "responses": ["DBATU has a well-equipped library that offers a wide range of books, research materials, and online resources. You can visit the library during its operating hours for access to study materials and research resources."],
      "context_set": ""
    },
    {
      "tag": "canteen",
      "patterns": ["Canteen facilities", "What's available in the canteen?", "Food options on campus"],
      "responses": ["DBATU has a canteen on campus that serves a variety of food options. You can enjoy a range of snacks and meals in the canteen during its operational hours."],
      "context_set": ""
    }
    
  ]
}
